ИС_СПОРТ_2022/src/Documents/ЕдиныйКалендарныйПлан/ЕдиныйКалендарныйПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЕдиныйКалендарныйПлан</name>
  <registerRecords>InformationRegister.ЕдиныеКалендарныеПланы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЕКП</name>
    <attributes>
      <name>ВидСпорта</name>
      <type>
        <types>CatalogRef.ВидыСпорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Соревнование</name>
      <type>
        <types>CatalogRef.Соревнование</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОрганизаторов</name>
      <type>
        <types>CatalogRef.ОрганизаторыСоревнований</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчастников</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТренеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Финансирование</name>
      <type>
        <types>CatalogRef.Финансирование</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПроведения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСоревнования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ЕдиныйКалендарныйПлан/Forms/ФормаДобавления/Module.bsl
&НаКлиенте
Процедура Добавить(Команда)
	Если ДатаОкончания = Дата(1,1,1) Тогда
		ДатаОкончания = ДатаНачала;
	КонецЕсли;
	Если ДатаОкончания >= ДатаНачала Тогда
		Параметр = новый Структура;
		Параметр.Вставить("Соревнование",Соревнование);
		Параметр.Вставить("ВидСпорта",ВидСпорта);
		Параметр.Вставить("НаименованиеОрганизаторов",НаименованиеОрганизаторов);
		Параметр.Вставить("Финансирование",Финансирование);
		Параметр.Вставить("МестоПроведения",МестоПроведения);
		Параметр.Вставить("ДатаНачала",ДатаНачала);
		Параметр.Вставить("ДатаОкончания",ДатаОкончания);
		Параметр.Вставить("КоличествоУчастников",КоличествоУчастников);
		Параметр.Вставить("КоличествоТренеров",КоличествоТренеров);
		Параметр.Вставить("НомерСтроки",НомерСтроки);
		Параметр.Вставить("НомерСоревнования",НомерСоревнования);
		Параметр.Вставить("Город",Город);
		ЭтаФорма.Закрыть(Параметр);
	Иначе
		Предупреждение();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура Предупреждение()
	ОбщегоНазначения.СообщитьПользователю("Некорректная дата окончания соревнования.");	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Соревнование") Тогда
		ВидСпорта = Параметры.ВидСпорта;
		НаименованиеОрганизаторов = Параметры.НаименованиеОрганизаторов;
		Финансирование = Параметры.Финансирование;
		МестоПроведения = Параметры.МестоПроведения;
		ДатаНачала = Параметры.ДатаНачала;
		ДатаОкончания = Параметры.ДатаОкончания;
		КоличествоУчастников = Параметры.КоличествоУчастников;
		КоличествоТренеров = Параметры.КоличествоТренеров;
		Соревнование = Параметры.Соревнование;
		НомерСтроки = Параметры.НомерСтроки;
		НомерСоревнования = Параметры.НомерСоревнования;
		Город = Параметры.Город;
	КонецЕсли;
	ПроверкаЗаполнения();
КонецПроцедуры
&НаСервере
Процедура ПроверкаЗаполнения()
	Если Соревнование.Пустая() ИЛИ ВидСпорта.Пустая() ИЛИ ПустаяСтрока(МестоПроведения)  ИЛИ
		ДатаНачала = Дата(1,1,1) ИЛИ КоличествоУчастников = 0 ИЛИ ПустаяСтрока(НомерСоревнования) Тогда
		Элементы.ФормаДобавить.Доступность = Ложь
	Иначе
		Элементы.ФормаДобавить.Доступность = Истина
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоревнованиеПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура ВидСпортаПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры
&НаКлиенте
Процедура МестоПроведенияПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУчастниковПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоТренеровПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура НомерСоревнованияПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры
